
{
  "name": "Aswitha",
  "contact": {
    "email": "aswitha44@gmail.com",
    "phone": "+1 (407) 467-2051",
    "github": "https://github.com/Aswitha44",
    "linkedin": "www.linkedin.com/in/aswitha-basam-7b5baa369"
  },
  "education": [
    {
      "institution": "University Of Central Florida",
      "degree": "Master of Science in Computer Science",
      "duration": "August 2023 - May 2025",
      "gpa": "4/4"
    }
  ],
  "experience": [
    {
      "company": "University Of Central Florida",
      "role": "Graduate Assistant",
      "duration": "February 2024 - May 2025",
      "responsibilities": [
        "Developed a parameterized predictive model in Python to determine optimal resilience hub placement using U.S. Census APIs and socioeconomic vulnerability indices.",
        "Built Angular dashboards to visualize optimal hub locations, enabling data-driven decisions for city planning.",
        "Trained over 80+ students in Discrete Mathematics and Design Analysis and Algorithms."
       
      ]
    },
    {
      "company": "VCAD PLM Services",
      "role": "Software Developer",
      "duration": "June 2022 - July 2023",
      "responsibilities": [
        "Engineered a budgeting platform using Angular Framework, allowing administrators to allocate, monitor, and report facility expenses across 100+ schools.",
        "Created drill-down dashboards with filters by category and time, cutting reporting time by 30%.",
        "Containerized microservices with Docker and deployed on Kubernetes, achieving scalable, fault-tolerant systems with 99.9% uptime."     
      ]
    },
    {
      "company": "VCAD PLM Services",
      "role": "Associate Software Developer",
      "duration": "November 2021 - May 2022",
      "responsibilities": [
        "Developed modular Angular applications with reactive forms, dependency-injected services, and pipes for real-time compliance dashboards; integrated with Spring Boot APIs and SQL databases for multi-tiered applications",
        "Optimized SQL queries, improving data retrieval by 45% for critical financial applications.",
        "Wrote unit and integration tests with JUnit and Mockito, maintaining 90%+ code coverage"       
      ]
    }
  ],
  "skills": {
    "languages": ["Java", "Python", "C", "C++", "C#"],
    "webDevelopment": ["HTML","CSS","SpringBoot","GraphQL", "React", "react Native", "Angular", "JavaScript", "TypeScript", "NodeJS", "ExpressJS", "Tailwind","Bootstrap","Jest","Cypress","Mocha"],
    "database": ["SQL Server", "MySQL", "MongoDB","Redis","PostgreSQL"],
    "cloudAndDevOps": ["Docker", "Azure", "AWS", "YAML", "Bash Scripting"],
    "certifications": ["AWS Certified Developer – Associate", "Microsoft Certified: Azure Fundamentals"]
  },
  "projects": [
    {
      "title": "Ski Surf E-commerce Web Application",
      "description": [
        "Designed a Full stack web app from scratch using Angular and ASP.NET Core.",
        "Implemented Stripe webhooks to safeguard transactions.",
        "Optimized cart performance using Redis caching.",
        "Secured authentication with .NET Core Identity, JWT and RBAC",
        "Deployed on Azure App Service with CI/CD using GitHub Actions."
      ],
      "link":"https://skisurfshop.azurewebsites.net/"
    },
    {
      "title": "Movie Theatre Club App",
      "description": [
        "Built a movie theater app  using Typescript React and MonogoDB with JWT authentication, securing 3 user roles.",
        "Deployed AWS app with auto-scaling across 4 EC2 instances, supporting 10,000+ ticket purchases",
        "Designed and optimized MongoDB schema and indexes to handle 50K+ concurrent read/write operations with average response time under 150ms"        
      ],
      "link":"https://github.com/Aswitha44/Movie-Theatre-Club-App"
    },
    {
      "title": "Serverless Automated File Processing System",
      "description": [
        "Designed and implemented a serverless file processing system on AWS",
        "Automated file management with S3 event-driven architecture.",
        "Utilized React to develop a responsive interface."
      ],
      "link":"https://github.com/Aswitha44/File-processing-system"
    },
    {
      "title": "Next-Gen Yoga App",
      "description": [
        "Integrated Firestore Vector Search Extension and generated vector embeddings using Vertex AI",
        "Leveraged Google Cloud services for multimodal content generation.",
        "Built a CRUD-based Yoga pose management application using Flask",
        "Used Gemini 2.0 Flash to generate Yoga pose descriptions."
      ],
      "link":"https://github.com/Aswitha44/Nextgen-Yoga-App"
    },
 {
      "title": "Cyber Guardian",
      "description": [
         "Built a phishing detection system using Logistic Regression with 96.7% accuracy, trained on engineered URL features.",
    "Developed a FastAPI backend and integrated it with a React frontend for secure, real-time URL threat predictions.",
    "Implemented lexical tokenization, stemming, and CountVectorizer for effective feature extraction and model performance.",
    "Enabled cross-origin API communication and deployed a full-stack solution with seamless UI/UX feedback."
      ],
      "link":"https://github.com/Aswitha44/cyber-guardian-phishing-detector"
    },
 {
      "title": "Handwritten Digit Recognition",
      "description": [
         "Built an ensemble classification model combining SVM , YOLO , and ResNet50, achieving 95.4% test accuracy.",
    "Trained models independently and combined predictions via weighted voting based on validation performance.",
    "Evaluated robustness under Gaussian and Salt-and-Pepper noise, demonstrating strong generalization to noisy data.- OpenCV",
    "Visualized results with confusion matrices, accuracy vs. noise plots, and side-by-side clean vs. noisy predictions."
      ],
      "link":"https://github.com/Aswitha44/digit-recognition"
    },
    {
      "title": "Portfolio Website",
      "description": [
        "Designed and developed a portfolio webiste from scratch using React",
        "Used Tailwind CSS for styling",
        "Implemented responsive design for mobile and tablet devices using Next.js"
      ],
      "link":"https://aswitha-portfolio-site.vercel.app/"
    }
  ]
}